<a href="https://colab.research.google.com/github/mfdali/BootcampDataAnalytics/blob/main/Query_database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Database with SQL

SQL basics

author: Monique @mfdali

Bootcamp challenge @WoMakersCode

## PostgreSQL instalation

In [1]:
# PostgreSQL installation
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Change user password postgres to 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 11.3 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.10.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.0.3)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.27
    Uninstalling SQLAlchemy-2.0.27:
      Successfully uninstalled SQLAlchemy-2.0.27
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 13.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 121749 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.030-1build3_amd64.deb ...
Unpacking libjson-xs-perl (4.030-1build3) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../06-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../07-postgresql-client-14_14.11-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.11-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../08-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../09-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../10-postgresql-14_14.11-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.11-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../11-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../12-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.030-1build3) ...
Setting up postgresql-client-14 (14.11-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.11-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## database path

In [2]:
# Access Google Drive in Colab
from google.colab import drive
drive.mount('/content/drive', force_remount=True)

Mounted at /content/drive

In [3]:
# Change directory
import os
os.chdir("drive/My Drive/Colab Notebooks/Bootcamp/Query/")

In [6]:
# Students table
#https://raw.githubusercontent.com/mfdali/BootcampDataAnalytics/main/data/alunos.sql

# Customers table
#https://raw.githubusercontent.com/mfdali/BootcampDataAnalytics/main/data/clientes.sql

### Set schema

In [4]:
# Create schema in Colab
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS alunos CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA alunos;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f alunos.sql

could not change directory to "/content/drive/My Drive/Colab Notebooks/Bootcamp/Query": Permission denied
NOTICE:  drop cascades to table alunos.alunos
DROP SCHEMA
could not change directory to "/content/drive/My Drive/Colab Notebooks/Bootcamp/Query": Permission denied
CREATE SCHEMA
SET SCHEMA 'alunos';
SET
CREATE TABLE alunos (
    id integer NOT NULL,
    nome character(30) NOT NULL,
    idade integer NOT NULL,
    curso character(40)
);
CREATE TABLE
INSERT INTO alunos (id, nome, idade, curso)
VALUES
(2536, 'ana silva', 17, 'biologia'),
(0123, 'joao nascimento', 25, 'educaçao física'),
(1799, 'hugo leal', 31, 'administração'),
(5432, 'Pedro Oliveira', 20, 'Psicologia'),
(2647, 'Juliana Lima', 22, 'Medicina'),
(3798, 'Lucas Fernandes', 23, 'Engenharia Civil'),
(1854, 'Carolina Souza', 24, 'Arquitetura'),
(6721, 'Gabriel Costa', 18, 'Direito'),
(8912, 'Amanda Santos', 26, 'Administração'),
(4268, 'Matheus Pereira', 20, 'Ciência da Computação'),
(1397, 'Camila Oliveira', 31, 'Enfermagem'),
(5089, 'Rodrigo Silva', 22, 'Biologia'),
(7523, 'Beatriz Ferreira', 19, 'Educação Física'),
(6185, 'Fernanda Almeida', 23, 'Economia'),
(3579, 'Rafael Martins', 20, 'Farmácia'),
(9274, 'Larissa Barbosa', 25, 'Administração'),
(6032, 'Diego Sousa', 26, 'Engenharia Elétrica'),
(2187, 'Mariana Costa', 27, 'Comunicação Social'),
(8351, 'Paulo Oliveira', 22, 'Medicina Veterinária'),
(4096, 'Patrícia Santos', 20, 'Nutrição'),
(5762, 'Thiago Silva', 23, 'Física'),
(2948, 'Aline Ferreira', 34, 'Psicologia'),
(7105, 'Vinícius Souza', 19, 'Direito'),
(8016, 'maria magalhaes', 19, 'economia'),
(8911, 'ana morello', 21, 'engenharia');
INSERT 0 25

In [5]:
# Create schema in Colab
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS clientes CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA clientes;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f clientes.sql

could not change directory to "/content/drive/MyDrive/Colab Notebooks/Bootcamp/Query": Permission denied
NOTICE:  drop cascades to 2 other objects
DETAIL:  drop cascades to table clientes.clientes
drop cascades to table clientes.compras
DROP SCHEMA
could not change directory to "/content/drive/MyDrive/Colab Notebooks/Bootcamp/Query": Permission denied
CREATE SCHEMA
SET SCHEMA 'clientes';
SET
CREATE TABLE clientes (
    id SERIAL PRIMARY KEY,
    nome character(30) NOT NULL,
    idade integer NOT NULL,
    saldo FLOAT
);
CREATE TABLE
INSERT INTO clientes (nome,idade,saldo)
VALUES
('Joana Donato', 35, 2506.50),
('Maria Nascimento', 28, 97.75),
('Andre Jacaranda', 40, 950.25),
('Ana Silva', 25, 1500.00),
('Lucas Oliveira', 32, 750.25),
('Camila Santos', 45, 3000.50),
('Pedro Costa', 22, 450.75),
('Juliana Ferreira', 38, 20000.00),
('Marcos Lima', 29, 1250.30),
('Carla Souza', 41, 850.99),
('Rafael Almeida', 27, 560.25),
('Aline Pereira', 36, 18000.75),
('Fernando Vieira', 31, 3750.50),
('Isabela Ribeiro', 26, 850.25),
('Thiago Oliveira', 39, 22000.00),
('Paula Martins', 23, 950.30),
('Roberto Santos', 37, 4250.99),
('Mariana Costa', 30, 1100.25),
('Emily Alves', 33, 10350.20),
('Mario Porto', 29, 30050.86);
INSERT 0 20

In [6]:
# Configuring PostgreSQL as environment variable DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [7]:
# Loading sql extension to use in Google Colab
%load_ext sql

%sql postgresql://postgres:postgres@localhost:5432/postgres

#Challenge tasks:

## Students table

### Basic queries and updates

In [8]:
# Choose table alunos to query
%%sql
SET SCHEMA 'alunos';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

1 - Write SQL queries to perform the following tasks:

a) Select all records from the students table.

b) Select the name and age of students older than 20 years.

c) Select students from the "Engineering" course in alphabetical order.

d) Count the total number of students in the table.

In [9]:
# Select all records from "alunos" table
%%sql
SELECT *
FROM alunos;

 * postgresql://postgres:***@localhost:5432/postgres
25 rows affected.

[(2536, 'ana silva                     ', 17, 'biologia                                '),
 (123, 'joao nascimento               ', 25, 'educaçao física                         '),
 (1799, 'hugo leal                     ', 31, 'administração                           '),
 (5432, 'Pedro Oliveira                ', 20, 'Psicologia                              '),
 (2647, 'Juliana Lima                  ', 22, 'Medicina                                '),
 (3798, 'Lucas Fernandes               ', 23, 'Engenharia Civil                        '),
 (1854, 'Carolina Souza                ', 24, 'Arquitetura                             '),
 (6721, 'Gabriel Costa                 ', 18, 'Direito                                 '),
 (8912, 'Amanda Santos                 ', 26, 'Administração                           '),
 (4268, 'Matheus Pereira               ', 20, 'Ciência da Computação                   '),
 (1397, 'Camila Oliveira               ', 31, 'Enfermagem                              '),
 (5089, 'Rodrigo Silva                 ', 22, 'Biologia                                '),
 (7523, 'Beatriz Ferreira              ', 19, 'Educação Física                         '),
 (6185, 'Fernanda Almeida              ', 23, 'Economia                                '),
 (3579, 'Rafael Martins                ', 20, 'Farmácia                                '),
 (9274, 'Larissa Barbosa               ', 25, 'Administração                           '),
 (6032, 'Diego Sousa                   ', 26, 'Engenharia Elétrica                     '),
 (2187, 'Mariana Costa                 ', 27, 'Comunicação Social                      '),
 (8351, 'Paulo Oliveira                ', 22, 'Medicina Veterinária                    '),
 (4096, 'Patrícia Santos               ', 20, 'Nutrição                                '),
 (5762, 'Thiago Silva                  ', 23, 'Física                                  '),
 (2948, 'Aline Ferreira                ', 34, 'Psicologia                              '),
 (7105, 'Vinícius Souza                ', 19, 'Direito                                 '),
 (8016, 'maria magalhaes               ', 19, 'economia                                '),
 (8911, 'ana morello                   ', 21, 'engenharia                              ')]

In [10]:
# Select the name and age of students older than 20 years
%%sql
SELECT nome, idade
FROM alunos
WHERE idade > 20;

 * postgresql://postgres:***@localhost:5432/postgres
16 rows affected.

[('joao nascimento               ', 25),
 ('hugo leal                     ', 31),
 ('Juliana Lima                  ', 22),
 ('Lucas Fernandes               ', 23),
 ('Carolina Souza                ', 24),
 ('Amanda Santos                 ', 26),
 ('Camila Oliveira               ', 31),
 ('Rodrigo Silva                 ', 22),
 ('Fernanda Almeida              ', 23),
 ('Larissa Barbosa               ', 25),
 ('Diego Sousa                   ', 26),
 ('Mariana Costa                 ', 27),
 ('Paulo Oliveira                ', 22),
 ('Thiago Silva                  ', 23),
 ('Aline Ferreira                ', 34),
 ('ana morello                   ', 21)]

In [13]:
#Select students from the "Engenharia" course in alphabetical order
%%sql
SELECT *
FROM alunos
WHERE lower(curso) like lower('Engenharia%')
ORDER BY nome;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(8911, 'ana morello                   ', 21, 'engenharia                              '),
 (6032, 'Diego Sousa                   ', 26, 'Engenharia Elétrica                     '),
 (3798, 'Lucas Fernandes               ', 23, 'Engenharia Civil                        ')]

In [14]:
#Count the total number of students in the table
%%sql
SELECT COUNT(*) AS total_students
FROM alunos;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(25,)]

2 - Update and Removal

a) Update the age of a specific student in the table.

b) Remove a student by their ID.

In [15]:
#Update age of a specific student
%%sql
UPDATE alunos
SET idade = 35
WHERE id = 1799;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [16]:
# Show values after update table
%%sql
SELECT *
FROM alunos
WHERE id = 1799;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(1799, 'hugo leal                     ', 35, 'administração                           ')]

In [17]:
#Remove a student by their ID
%%sql
DELETE FROM alunos
WHERE id = 8016;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [18]:
# Display table after deletion
%%sql
SELECT *
FROM alunos;

 * postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

[(2536, 'ana silva                     ', 17, 'biologia                                '),
 (123, 'joao nascimento               ', 25, 'educaçao física                         '),
 (5432, 'Pedro Oliveira                ', 20, 'Psicologia                              '),
 (2647, 'Juliana Lima                  ', 22, 'Medicina                                '),
 (3798, 'Lucas Fernandes               ', 23, 'Engenharia Civil                        '),
 (1854, 'Carolina Souza                ', 24, 'Arquitetura                             '),
 (6721, 'Gabriel Costa                 ', 18, 'Direito                                 '),
 (8912, 'Amanda Santos                 ', 26, 'Administração                           '),
 (4268, 'Matheus Pereira               ', 20, 'Ciência da Computação                   '),
 (1397, 'Camila Oliveira               ', 31, 'Enfermagem                              '),
 (5089, 'Rodrigo Silva                 ', 22, 'Biologia                                '),
 (7523, 'Beatriz Ferreira              ', 19, 'Educação Física                         '),
 (6185, 'Fernanda Almeida              ', 23, 'Economia                                '),
 (3579, 'Rafael Martins                ', 20, 'Farmácia                                '),
 (9274, 'Larissa Barbosa               ', 25, 'Administração                           '),
 (6032, 'Diego Sousa                   ', 26, 'Engenharia Elétrica                     '),
 (2187, 'Mariana Costa                 ', 27, 'Comunicação Social                      '),
 (8351, 'Paulo Oliveira                ', 22, 'Medicina Veterinária                    '),
 (4096, 'Patrícia Santos               ', 20, 'Nutrição                                '),
 (5762, 'Thiago Silva                  ', 23, 'Física                                  '),
 (2948, 'Aline Ferreira                ', 34, 'Psicologia                              '),
 (7105, 'Vinícius Souza                ', 19, 'Direito                                 '),
 (8911, 'ana morello                   ', 21, 'engenharia                              '),
 (1799, 'hugo leal                     ', 35, 'administração                           ')]

## Customers table

### Queries and Aggregate Functions

In [19]:
# Choose clientes schema where query will be done
%%sql
SET SCHEMA 'clientes';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [20]:
# Select all records from "clientes" table
%%sql
SELECT *
FROM clientes;

 * postgresql://postgres:***@localhost:5432/postgres
20 rows affected.

[(1, 'Joana Donato                  ', 35, 2506.5),
 (2, 'Maria Nascimento              ', 28, 97.75),
 (3, 'Andre Jacaranda               ', 40, 950.25),
 (4, 'Ana Silva                     ', 25, 1500.0),
 (5, 'Lucas Oliveira                ', 32, 750.25),
 (6, 'Camila Santos                 ', 45, 3000.5),
 (7, 'Pedro Costa                   ', 22, 450.75),
 (8, 'Juliana Ferreira              ', 38, 20000.0),
 (9, 'Marcos Lima                   ', 29, 1250.3),
 (10, 'Carla Souza                   ', 41, 850.99),
 (11, 'Rafael Almeida                ', 27, 560.25),
 (12, 'Aline Pereira                 ', 36, 18000.75),
 (13, 'Fernando Vieira               ', 31, 3750.5),
 (14, 'Isabela Ribeiro               ', 26, 850.25),
 (15, 'Thiago Oliveira               ', 39, 22000.0),
 (16, 'Paula Martins                 ', 23, 950.3),
 (17, 'Roberto Santos                ', 37, 4250.99),
 (18, 'Mariana Costa                 ', 30, 1100.25),
 (19, 'Emily Alves                   ', 33, 10350.2),
 (20, 'Mario Porto                   ', 29, 30050.86)]

1 - Write SQL queries to perform the following tasks:

a) Select the name and age of customers older than 30 years.

b) Calculate the average balance of customers.

c) Find the customer with the maximum balance.

d) Count how many customers have a balance above 1000.

In [21]:
# Select the name and age of customers older than 30 years
%%sql
SELECT nome, idade
FROM clientes
WHERE idade > 30;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[('Joana Donato                  ', 35),
 ('Andre Jacaranda               ', 40),
 ('Lucas Oliveira                ', 32),
 ('Camila Santos                 ', 45),
 ('Juliana Ferreira              ', 38),
 ('Carla Souza                   ', 41),
 ('Aline Pereira                 ', 36),
 ('Fernando Vieira               ', 31),
 ('Thiago Oliveira               ', 39),
 ('Roberto Santos                ', 37),
 ('Emily Alves                   ', 33)]

In [22]:
# Calculate the average balance of customers
%%sql
SELECT AVG(saldo) AS avg_balance
FROM clientes;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(6161.082,)]

In [23]:
#Find the customer with the maximum balance
%%sql
SELECT id, nome, saldo
FROM clientes
WHERE saldo =
(SELECT MAX(saldo) FROM clientes);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(20, 'Mario Porto                   ', 30050.86)]

In [24]:
#Count how many customers have a balance above 1000
%%sql
SELECT COUNT(*) AS count_above_1000
FROM clientes
WHERE saldo > 1000;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(12,)]

2 - Update and Removal with Conditions

a) Update the balance of a specific customer.

b) Remove a customer by their ID.

In [25]:
#Update the balance of a specific customer
%%sql
UPDATE clientes
SET saldo = saldo + 1000
WHERE id = 4;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [26]:
# Show table after updating
%%sql
select *
from clientes
where id = 4;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(4, 'Ana Silva                     ', 25, 2500.0)]

In [27]:
#Remove a customer by their ID
%%sql
DELETE FROM clientes
WHERE id = 2;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [28]:
# Show table after deletion
%%sql
select *
from clientes;

 * postgresql://postgres:***@localhost:5432/postgres
19 rows affected.

[(1, 'Joana Donato                  ', 35, 2506.5),
 (3, 'Andre Jacaranda               ', 40, 950.25),
 (5, 'Lucas Oliveira                ', 32, 750.25),
 (6, 'Camila Santos                 ', 45, 3000.5),
 (7, 'Pedro Costa                   ', 22, 450.75),
 (8, 'Juliana Ferreira              ', 38, 20000.0),
 (9, 'Marcos Lima                   ', 29, 1250.3),
 (10, 'Carla Souza                   ', 41, 850.99),
 (11, 'Rafael Almeida                ', 27, 560.25),
 (12, 'Aline Pereira                 ', 36, 18000.75),
 (13, 'Fernando Vieira               ', 31, 3750.5),
 (14, 'Isabela Ribeiro               ', 26, 850.25),
 (15, 'Thiago Oliveira               ', 39, 22000.0),
 (16, 'Paula Martins                 ', 23, 950.3),
 (17, 'Roberto Santos                ', 37, 4250.99),
 (18, 'Mariana Costa                 ', 30, 1100.25),
 (19, 'Emily Alves                   ', 33, 10350.2),
 (20, 'Mario Porto                   ', 29, 30050.86),
 (4, 'Ana Silva                     ', 25, 2500.0)]

3 - Table Join

Create a second table called "compras" with the fields: id (primary key), customer_id (foreign key referencing the id of the "customers" table), product (text), and value (real). Insert some purchases associated with existing customers in the "customers" table.

Write a query to display the name of the customer, the product, and the value of each purchase.

In [29]:
# Create compras table
%%sql

CREATE TABLE compras (
    id SERIAL PRIMARY KEY,
    cliente_id INTEGER REFERENCES clientes(id),
    produto character(50) NOT NULL,
    valor REAL
);

INSERT INTO compras (cliente_id,produto,valor)
VALUES
(5, 'Laptop', 1200.00),
(6, 'Mouse', 39.90),
(1, 'Teclado', 99.90),
(8, 'Monitor', 799.90),
(10, 'Cadeira de Escritório', 499.90),
(12, 'Impressora', 299.90),
(14, 'Livro', 29.90),
(4, 'Mesa para Computador', 399.90),
(9, 'Fone de Ouvido', 149.90),
(13, 'Mochila', 89.90),
(5, 'Caixa de Som', 199.90),
(11, 'Luminária', 79.90),
(15, 'Relógio de Parede', 59.90),
(7, 'Pen Drive', 49.90),
(1, 'HD Externo', 299.90),
(3, 'Webcam', 199.90),
(3, 'Smartphone', 799.99),
(1, 'Tablet', 499.99),
(4, 'Smartwatch', 299.99);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
19 rows affected.

[]

In [31]:
#display the name of the customer, the product, and the value of each purchase
%%sql
SELECT c.nome AS nome_cliente, p.produto, p.valor as valor__produto
FROM clientes c
JOIN compras p ON c.id = p.cliente_id;

 * postgresql://postgres:***@localhost:5432/postgres
19 rows affected.

[('Lucas Oliveira                ', 'Laptop                                            ', 1200.0),
 ('Camila Santos                 ', 'Mouse                                             ', 39.9),
 ('Joana Donato                  ', 'Teclado                                           ', 99.9),
 ('Juliana Ferreira              ', 'Monitor                                           ', 799.9),
 ('Carla Souza                   ', 'Cadeira de Escritório                             ', 499.9),
 ('Aline Pereira                 ', 'Impressora                                        ', 299.9),
 ('Isabela Ribeiro               ', 'Livro                                             ', 29.9),
 ('Ana Silva                     ', 'Mesa para Computador                              ', 399.9),
 ('Marcos Lima                   ', 'Fone de Ouvido                                    ', 149.9),
 ('Fernando Vieira               ', 'Mochila                                           ', 89.9),
 ('Lucas Oliveira                ', 'Caixa de Som                                      ', 199.9),
 ('Rafael Almeida                ', 'Luminária                                         ', 79.9),
 ('Thiago Oliveira               ', 'Relógio de Parede                                 ', 59.9),
 ('Pedro Costa                   ', 'Pen Drive                                         ', 49.9),
 ('Joana Donato                  ', 'HD Externo                                        ', 299.9),
 ('Andre Jacaranda               ', 'Webcam                                            ', 199.9),
 ('Andre Jacaranda               ', 'Smartphone                                        ', 799.99),
 ('Joana Donato                  ', 'Tablet                                            ', 499.99),
 ('Ana Silva                     ', 'Smartwatch                                        ', 299.99)]